guilecraft/guilecraft-libs.org
* A Journey Through a Guilecraft Game
** Initialization
1) Client -> Controller: (controller 'list-modules)
   1) Controller -> Library: (request-module-list)
      1) Library -> File-Server: (get-from-file-server 'scan-modules)
      2) File-Server -> Library: list-of-modules
   2) Library -> Controller: list-of-modules
2) Controller -> Client: list-of-modules
*** TODO introduce way to select user profile :roadmap:
** First Question
3) Client -> Controller: (controller 'generate-question module-name user-name level)
   1) = Controller: module-name/user-name/level/
   2) Controller -> Generator: (compile-question)
      1) Generator -> Balancer: (request-tags)
	 1) if 'tag-list empty: Balancer -> Controller: (request-current-module)
	    1) Controller -> Balancer: current-module-name
	    2) Balancer -> File-Server: (get-from-file-server 'balancer-data current-module-name)
	    3) if File-Server data: File-Server -> Balancer: balancer-current-module-data
	 2) Balancer -> Library: (request-current-tags-set)
	    1) Library -> Controller: (request-current-module)
	    2) Controller -> Library: current-module-name
	       1) Library -> File-Server: (get-from-file-server 'load-module current-module-name)
	       2) File-Server -> Library: rules, tag-streams, tag-list
	       3) = Library: rules/tag-streams/tag-list/
	 3) Library -> Balancer: tag-list
	 4) = Balancer: tag-list/scores/schedules/
      2) Balancer -> Generator: tag(s)
      3) Generator -> Library: (request-question tag)
      4) Library -> Generator: (question (stream-car (cdr tag-stream))) => question
   3) Generator -> Controller: question
4) Controller -> Client: question
** First Evaluation
5) Client -> Controller: (controller 'evaluate-answer answer)
   1) Controller -> Evaluator: (evaluate-answer answer)
      1) Evaluator -> Library: (request-solution-pattern-and-rules)
      2) Library -> Evaluator: solution-pattern rules
      3) = Evaluator: answer/solution-pattern/rules => evaluation
      4) Evaluator -> Balancer: evaluation
	 1. Balancer: (store-new-score)
      5) Balancer -> Evaluator: evaluation
   2) Evaluator -> Controller: evaluation
6) Controller -> Client: evaluation
7) Client -> Controller: (controller 'generate-question) => Restart above.
** Back to Go
Shortened Cycle now all data is loaded.
* The Session Controller
  :PROPERTIES:
  :tangle:   ./controller.scm
  :END:
*** TODO Allow for a way to switch module, level: :roadmap:
- in game for module? (change module and balancer gradually incorporates new tags?)
- total reset: store current info, move on to new settings as if restarted.
- Also: enable/disable additional module, to allow for learning several subjects at once.
*** TODO Allow for a way to switch username :roadmap:
- hard reset: save and restart.
