guilecraft/guilecraft-libs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>guilecraft-libs</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="guilecraft-libs"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-10T10:26+0000"/>
<meta name="author" content="Alex Sassmannshausen"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">guilecraft-libs</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 A Journey Through a Guilecraft Game</a>
<ul>
<li><a href="#sec-1-1">1.1 Initialization</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 introduce way to select user profile</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 First Question</a></li>
<li><a href="#sec-1-3">1.3 First Evaluation</a></li>
<li><a href="#sec-1-4">1.4 Back to Go</a></li>
</ul>
</li>
<li><a href="#sec-2">2 The Session Controller</a>
<ul>
<li>
<ul>
<li><a href="#sec-2-1">2.1 Allow for a way to switch module, level:</a></li>
<li><a href="#sec-2-2">2.2 Allow for a way to switch username</a></li>
</ul>
</li>
<li><a href="#sec-2-1">2.1 Guile Documentation</a></li>
<li><a href="#sec-2-2">2.2 Module Definition</a></li>
<li><a href="#sec-2-3">2.3 Session Manager</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 Introduction</a></li>
<li><a href="#sec-2-3-2">2.3.2 Code</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 Old Functions</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 Request Challenge</a></li>
<li><a href="#sec-2-4-2">2.4.2 Problem ID Store</a></li>
<li><a href="#sec-2-4-3">2.4.3 Request Evaluation</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 The Generator</a>
<ul>
<li><a href="#sec-3-1">3.1 Guile Documentation</a></li>
<li><a href="#sec-3-2">3.2 Module Definition</a></li>
<li><a href="#sec-3-3">3.3 Generator</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 Introduction</a></li>
<li><a href="#sec-3-3-2">3.3.2 Code</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4 Select Tag</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 Introduction</a></li>
<li><a href="#sec-3-4-2">3.4.2 Code</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5 Old Functions</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 Choose Problem</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 The Balancer</a>
<ul>
<li>
<ul>
<li><a href="#sec-4-1">4.1 Balancer should be written to use a stream internally to generate the next set of lowest scoring tags.</a></li>
</ul>
</li>
<li><a href="#sec-4-1">4.1 Guile Documentation</a></li>
<li><a href="#sec-4-2">4.2 Module Definition</a></li>
<li><a href="#sec-4-3">4.3 Request Tags: public access</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 Intro</a></li>
<li><a href="#sec-4-3-2">4.3.2 Code</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4 Helper Functions: initial population and retrieving the lowest ranking set</a></li>
<li><a href="#sec-4-5">4.5 Updating the rank-table</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1 Code:</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6 State: rank-table</a></li>
</ul>
</li>
<li><a href="#sec-5">5 The Library</a>
<ul>
<li><a href="#sec-5-1">5.1 Guile Documentation</a></li>
<li><a href="#sec-5-2">5.2 Module Definition</a></li>
<li><a href="#sec-5-3">5.3 Librarian:</a></li>
<li><a href="#sec-5-4">5.4 Library</a></li>
<li><a href="#sec-5-5">5.5 Library as a stream</a></li>
<li><a href="#sec-5-6">5.6 Old functions:</a></li>
</ul>
</li>
<li><a href="#sec-6">6 The File Server</a>
<ul>
<li><a href="#sec-6-1">6.1 Introduction</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1 When is file-server used?</a></li>
<li><a href="#sec-6-1-2">6.1.2 Guilecraft is non-destructive</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2 Module definition</a></li>
<li><a href="#sec-6-3">6.3 Entrance — get-from-file-server, put-on-file-server and select-from-file-server:</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1 get-from-file-server</a></li>
<li><a href="#sec-6-3-2">6.3.2 put-on-file-server</a></li>
<li><a href="#sec-6-3-3">6.3.3 select-from-file-server</a></li>
<li><a href="#sec-6-3-4">6.3.4 Helper functions</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 The Data Types</a>
<ul>
<li><a href="#sec-7-1">7.1 Guile Documentation</a></li>
<li><a href="#sec-7-2">7.2 Module Definition</a></li>
<li><a href="#sec-7-3">7.3 Creators</a>
<ul>
<li><a href="#sec-7-3-1">7.3.1 Question</a></li>
<li><a href="#sec-7-3-2">7.3.2 Solution</a></li>
<li><a href="#sec-7-3-3">7.3.3 Tag</a></li>
<li><a href="#sec-7-3-4">7.3.4 Problems</a></li>
<li><a href="#sec-7-3-5">7.3.5 Level</a></li>
<li><a href="#sec-7-3-6">7.3.6 Module</a></li>
</ul>
</li>
<li><a href="#sec-7-4">7.4 Selectors</a></li>
<li><a href="#sec-7-5">7.5 Predicates</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A Journey Through a Guilecraft Game</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Initialization</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>Client -&gt; Controller: (controller 'list-modules)
<ol>
<li>Controller -&gt; Library: (request-module-list)
<ol>
<li>Library -&gt; File-Server: (get-from-file-server 'scan-modules)
</li>
<li>File-Server -&gt; Library: list-of-modules
</li>
</ol>

</li>
<li>Library -&gt; Controller: list-of-modules
</li>
</ol>

</li>
<li>Controller -&gt; Client: list-of-modules
</li>
</ol>


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> <span class="todo TODO">TODO</span> introduce way to select user profile &nbsp;&nbsp;&nbsp;<span class="tag"><span class="roadmap">roadmap</span></span></h4>
<div class="outline-text-4" id="text-1-1-1">

</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> First Question</h3>
<div class="outline-text-3" id="text-1-2">

<ol>
<li>Client -&gt; Controller: (controller 'generate-question module-name user-name level)
<ol>
<li>= Controller: module-name/user-name/level/
</li>
<li>Controller -&gt; Generator: (compile-question)
<ol>
<li>Generator -&gt; Balancer: (request-tags)
<ol>
<li>if 'tag-list empty: Balancer -&gt; Controller: (request-current-module)
<ol>
<li>Controller -&gt; Balancer: current-module-name
</li>
<li>Balancer -&gt; File-Server: (get-from-file-server 'balancer-data current-module-name)
</li>
<li>if File-Server data: File-Server -&gt; Balancer: balancer-current-module-data
</li>
</ol>

</li>
<li>Balancer -&gt; Library: (request-current-tags-set)
<ol>
<li>Library -&gt; Controller: (request-current-module)
</li>
<li>Controller -&gt; Library: current-module-name
<ol>
<li>Library -&gt; File-Server: (get-from-file-server 'load-module current-module-name)
</li>
<li>File-Server -&gt; Library: rules, tag-streams, tag-list
</li>
<li>= Library: rules/tag-streams/tag-list/
</li>
</ol>

</li>
</ol>

</li>
<li>Library -&gt; Balancer: tag-list
</li>
<li>= Balancer: tag-list/scores/schedules/
</li>
</ol>

</li>
<li>Balancer -&gt; Generator: tag(s)
</li>
<li>Generator -&gt; Library: (request-question tag)
</li>
<li>Library -&gt; Generator: (question (stream-car (cdr tag-stream))) =&gt; question
</li>
</ol>

</li>
<li>Generator -&gt; Controller: question
</li>
</ol>

</li>
<li>Controller -&gt; Client: question
</li>
</ol>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> First Evaluation</h3>
<div class="outline-text-3" id="text-1-3">

<ol>
<li>Client -&gt; Controller: (controller 'evaluate-answer answer)
<ol>
<li>Controller -&gt; Evaluator: (evaluate-answer answer)
<ol>
<li>Evaluator -&gt; Library: (request-solution-pattern-and-rules)
</li>
<li>Library -&gt; Evaluator: solution-pattern rules
</li>
<li>= Evaluator: answer/solution-pattern/rules =&gt; evaluation
</li>
<li>Evaluator -&gt; Balancer: evaluation
<ol>
<li>Balancer: (store-new-score)
</li>
</ol>

</li>
<li>Balancer -&gt; Evaluator: evaluation
</li>
</ol>

</li>
<li>Evaluator -&gt; Controller: evaluation
</li>
</ol>

</li>
<li>Controller -&gt; Client: evaluation
</li>
<li>Client -&gt; Controller: (controller 'generate-question) =&gt; Restart above.
</li>
</ol>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Back to Go</h3>
<div class="outline-text-3" id="text-1-4">

<p>Shortened Cycle now all data is loaded.
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Session Controller</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-4">
<h4 id="sec-2-1"><span class="section-number-4">2.1</span> <span class="todo TODO">TODO</span> Allow for a way to switch module, level: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="roadmap">roadmap</span></span></h4>
<div class="outline-text-4" id="text-2-1">

<ul>
<li>in game for module? (change module and balancer gradually incorporates new tags?)
</li>
<li>total reset: store current info, move on to new settings as if restarted.
</li>
<li>Also: enable/disable additional module, to allow for learning several subjects at once.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-4">
<h4 id="sec-2-2"><span class="section-number-4">2.2</span> <span class="todo TODO">TODO</span> Allow for a way to switch username &nbsp;&nbsp;&nbsp;<span class="tag"><span class="roadmap">roadmap</span></span></h4>
<div class="outline-text-4" id="text-2-2">

<ul>
<li>hard reset: save and restart.
</li>
</ul>

</div>

</div>
