guilecraft/guilecraft-libs.org
** Guile Documentation
#+name: documentation
#+begin_src scheme :shebang "#! /usr/bin/guile -s"
  coding:utf-8
  !#
  ;;; Commentary:
  
  ;;; Controller acts as the interface between client-UIs and
  ;;; the guilecraft modules/servers.
  ;;; Benefit is that client UIs merely have to implement some,
  ;;; or optionally, all, exported controller procedures, which
  ;;; ensures backward compatibility of the UIs. On the other
  ;;; hand, extensions to guilecraft can be made in the backend
  ;;; without having to worry about implementing all necessary 
  ;;; changes in the UIs.
  ;;; Centralizing traffic through controller also allows for 
  ;;; easier development of multiple simultaniously active clients
  ;;; on one server, and reduces the amount of paths needed between
  ;;; the lower level modules/servers.
  ;;; It will risk creating a bottle-neck at controller, which might
  ;;; have to be resolved by turning controller into a load-balancing
  ;;; server, and letting session management occur further down, in
  ;;; an as yet non-existing layer.
    
  ;;; Code:
#+end_src
** Module Definition
#+name: module-definition
#+BEGIN_SRC scheme  
  (define-module (guilecraft controller)
    #:export (controller)                 ; by client
    #:use-module (guilecraft generator)   ; for compile-question
    #:use-module (guilecraft evaluator)   ; for request-evaluation
  )
  #+END_SRC
** Session Manager
*** Introduction
Users interact with Guilecraft through a client. To facilitate the easy development of multiple different clients, Guilecraft channels this interaction through Controller. Controller is the single point of entry and exit for data — it accepts commands from the client and returns Guilecraft data.
*** Code
**** TODO integrate request-evaluation @ Evaluator :basic:
**** Enable profile selection
**** Enable module selection
**** Enable Level Selection (intelligent?)
**** Code:
#+name: controller
#+BEGIN_SRC scheme  
  (define (controller command . parameters)
      (let ((profile "atheia")
            (module "guile")
            (level 1))
        (cond ((eqv? command 'generate-question)
               (compile-question))        ;from Generator
              ((eqv? command 'evaluate-answer)
               (request-evaluation (car parameters))))))
  #+END_SRC
     
** Old Functions
*** Request Challenge
This is now superseded: question selection is entirely handled by the Generator, which merely returns the value of question through request question above. 
(define (request-challenge)
  "Procedure to return a question to a requesting client.
No input is necessary at this stage."
  (request-question 			; From Library
   (problem-ID-store			; From .here.
    (choose-problem problems))))	; From Generator

*** Problem ID Store
This is now superseded because controller is no longer used to store the problem ID. This is handled by the streams in the library.
;;; choose-problem in request-challenge returns a problem-ID 
;;; which is then needed by request-evaluation:
(define (problem-ID-store problem-ID)
  "Procedure which stores problem-ID in use for future reference, or releases it.
To store, invoke with 'store as the first argument and the problem-ID as the second argument.
To retrieve, invoke with 'retrieve as the first argument.
In both cases problem-ID-store returns the problem-ID."
  (if (>= problem-ID 0)
      (begin
	(set! ID problem-ID)		; Change global state
	ID)				; Return new global state
      ID))				; Return old global state

*** Request Evaluation
This is now located in Evaluator — controller merely calls it from evaluator and expects the result of evalution. This is the result of placing the problem-ID-store within the sphere of the library.
(define (request-evaluation answer)
  "Procedure to return #t or #f to the client upon being called with the user's answer. 

This procedure would originally also return additional information, like the solution, explanation and links to education. This is now conceived off as being handled by further queries from the client."
  (ranking-put 				; From balancer
   (problem-ID-store -1)		; From .here.
   (if (correct-answer?			; From Evaluator
	(problem-ID-store -1)		; From .here.
	answer)				; From client
       #t				; Evaluation for ranking-put
       #f)))				; Evaluation for ranking-put
	
* The Generator
  :PROPERTIES:
  :tangle:   ./generator.scm
  :END:
** Guile Documentation
#+name: documentation 
#+BEGIN_SRC scheme :shebang "#! /usr/bin/guile -s"
  coding:utf-8
  !#
  ;;; Commentary:
  
  ;;; Generator picks lowest ranking (weighting supplied by 
  ;;; balancer) question from available problem IDs 
  ;;; (supplied by library), or picks random if multiple 
  ;;; lowest ranks. Returns question & meta info to UI.
  ;;; Stores Problem-ID for query by Evaluator.
  
  ;;; Code:
#+END_SRC
** Module Definition
#+name: module-definition
#+BEGIN_SRC scheme  
  (define-module (guilecraft generator)
      #:export (compile-question)         ; by Controller
      #:use-module (guilecraft balancer)  ; for request-tags
      #:use-module (guilecraft library)   ; for request-question
  )
  #+END_SRC
** Generator
