guilecraft/guilecraft-libs.html

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Guile Documentation</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-scheme">coding:utf-8
!#
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Commentary:</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Controller acts as the interface between client-UIs and</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">the guilecraft modules/servers.</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Benefit is that client UIs merely have to implement some,</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">or optionally, all, exported controller procedures, which</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">ensures backward compatibility of the UIs. On the other</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">hand, extensions to guilecraft can be made in the backend</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">without having to worry about implementing all necessary </span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">changes in the UIs.</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Centralizing traffic through controller also allows for </span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">easier development of multiple simultaniously active clients</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">on one server, and reduces the amount of paths needed between</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">the lower level modules/servers.</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">It will risk creating a bottle-neck at controller, which might</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">have to be resolved by turning controller into a load-balancing</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">server, and letting session management occur further down, in</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">an as yet non-existing layer.</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Code:</span>
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Module Definition</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define-module</span> (<span style="color: #2F8B58; font-weight: bold;">guilecraft</span> controller)
  <span style="color: #A020F0;">#:export</span> (controller)                 <span style="color: #204A87;">; </span><span style="color: #204A87;">by client</span>
  <span style="color: #A020F0;">#:use-module</span> (guilecraft generator)   <span style="color: #204A87;">; </span><span style="color: #204A87;">for compile-question</span>
  <span style="color: #A020F0;">#:use-module</span> (guilecraft evaluator)   <span style="color: #204A87;">; </span><span style="color: #204A87;">for request-evaluation</span>
)
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Session Manager</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Introduction</h4>
<div class="outline-text-4" id="text-2-3-1">

<p>Users interact with Guilecraft through a client. To facilitate the easy development of multiple different clients, Guilecraft channels this interaction through Controller. Controller is the single point of entry and exit for data — it accepts commands from the client and returns Guilecraft data.
</p></div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Code</h4>
<div class="outline-text-4" id="text-2-3-2">

<ul>
<li id="sec-2-3-2-1"><span class="todo TODO">TODO</span> integrate request-evaluation @ Evaluator &nbsp;&nbsp;&nbsp;<span class="tag"><span class="basic">basic</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-2-3-2-2">Enable profile selection<br/>
</li>
</ul>
<ul>
<li id="sec-2-3-2-3">Enable module selection<br/>
</li>
</ul>
<ul>
<li id="sec-2-3-2-4">Enable Level Selection (intelligent?)<br/>
</li>
</ul>
<ul>
<li id="sec-2-3-2-5">Code:<br/>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">controller</span> command . parameters)
    (<span style="color: #A52A2A; font-weight: bold;">let</span> ((profile <span style="color: #4E9A06;">"atheia"</span>)
          (module <span style="color: #4E9A06;">"guile"</span>)
          (level 1))
      (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((eqv? command 'generate-question)
             (compile-question))        <span style="color: #204A87;">;</span><span style="color: #204A87;">from Generator</span>
            ((eqv? command 'evaluate-answer)
             (request-evaluation (car parameters))))))
</pre>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Old Functions</h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> Request Challenge</h4>
<div class="outline-text-4" id="text-2-4-1">

<p>This is now superseded: question selection is entirely handled by the Generator, which merely returns the value of question through request question above. 
(define (request-challenge)
  "Procedure to return a question to a requesting client.
No input is necessary at this stage."
  (request-question                     ; From Library
   (problem-ID-store                    ; From .here.
    (choose-problem problems))))        ; From Generator
</p>
</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Problem ID Store</h4>
<div class="outline-text-4" id="text-2-4-2">

<p>This is now superseded because controller is no longer used to store the problem ID. This is handled by the streams in the library.
;;; choose-problem in request-challenge returns a problem-ID 
;;; which is then needed by request-evaluation:
(define (problem-ID-store problem-ID)
  "Procedure which stores problem-ID in use for future reference, or releases it.
To store, invoke with 'store as the first argument and the problem-ID as the second argument.
To retrieve, invoke with 'retrieve as the first argument.
In both cases problem-ID-store returns the problem-ID."
  (if (&gt;= problem-ID 0)
      (begin
        (set! ID problem-ID)            ; Change global state
        ID)                             ; Return new global state
      ID))                              ; Return old global state
</p>
</div>

</div>

<div id="outline-container-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> Request Evaluation</h4>
<div class="outline-text-4" id="text-2-4-3">

<p>This is now located in Evaluator — controller merely calls it from evaluator and expects the result of evalution. This is the result of placing the problem-ID-store within the sphere of the library.
(define (request-evaluation answer)
  "Procedure to return #t or #f to the client upon being called with the user's answer. 
</p>
<p>
This procedure would originally also return additional information, like the solution, explanation and links to education. This is now conceived off as being handled by further queries from the client."
  (ranking-put                          ; From balancer
   (problem-ID-store -1)                ; From .here.
   (if (correct-answer?                 ; From Evaluator
        (problem-ID-store -1)           ; From .here.
        answer)                         ; From client
       #t                               ; Evaluation for ranking-put
       #f)))                            ; Evaluation for ranking-put
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Generator</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Guile Documentation</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="src src-scheme">coding:utf-8
!#
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Commentary:</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Generator picks lowest ranking (weighting supplied by </span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">balancer) question from available problem IDs </span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">(supplied by library), or picks random if multiple </span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">lowest ranks. Returns question &amp; meta info to UI.</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Stores Problem-ID for query by Evaluator.</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Code:</span>
</pre>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Module Definition</h3>
<div class="outline-text-3" id="text-3-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define-module</span> (<span style="color: #2F8B58; font-weight: bold;">guilecraft</span> generator)
    <span style="color: #A020F0;">#:export</span> (compile-question)         <span style="color: #204A87;">; </span><span style="color: #204A87;">by Controller</span>
    <span style="color: #A020F0;">#:use-module</span> (guilecraft balancer)  <span style="color: #204A87;">; </span><span style="color: #204A87;">for request-tags</span>
    <span style="color: #A020F0;">#:use-module</span> (guilecraft library)   <span style="color: #204A87;">; </span><span style="color: #204A87;">for request-question</span>
)
</pre>

</div>

</div>
