guilecraft/guilecraft-libs.org
*** Introduction
The role of the Generator is to obtain a question. In order to do so it obtains a list of tags from the Balancer, from which it then selects one at random (if necessary) and requests a corresponding question from the stream in the library.

Compile Question:
- first obtains a list of low-scoring or scheduled tags from Balancer, using its exported request-tags.
- It then selects one of those tags, using Generator's select-tag.
- Finally it obtains a question from library's tag-based streams using its exported request-question.
It returns the result of this operation to its caller, normally Controller.
*** Code
**** TODO integrate request-question @ library :basic:
**** TODO integrate request-tags @ balancer :basic:
**** Compile Question
#+name: compile question
#+BEGIN_SRC scheme  
  (define (compile-question)
      "Procedure which algorithmically returns one question.
  
  No input is necessary for this activity."
      (request-question              ;from Library
       (select-tag                        ;from Here
        (request-tags))))                 ;from Balancer
  #+END_SRC
** Select Tag
*** Introduction
Select Tag is a procedure to reduce a list containing one or more tags to only one tag, provided as a symbol.

One can envisage this being done through a sophisticated algorithm. For now it is simply done by picking the first tag in the list.
*** Code
#+name: select-tag
#+BEGIN_SRC scheme
  (define (select-tag tag-list)
    "Select exactly one tag from a list of tags.
    
    Input is normally a list of tags retrieved from the Balancer. Returns a single symbol that is a tag, normally used to activate a stream in the Library."
      (car tag-list))
  #+END_SRC
** Old Functions
*** Choose Problem
This function has been significantly re-designed as a consequence of storing the current question through the use of streams in the Library.
(define (choose-problem mylist)
  "Procedure which algorithmically returns one of the lowest-ranking problem-IDs supplied via request-ranking.
No input is necessary for this activity."
  (car (request-ranked-ID mylist)))

* The Balancer
  :PROPERTIES:
  :tangle:   ./balancer.scm
  :END:
*** TODO Balancer should be written to use a stream internally to generate the next set of lowest scoring tags. :architecture:
** Guile Documentation
#+name: documentation
#+BEGIN_SRC scheme :shebang "#! /usr/bin/guile -s"  
  coding:utf-8
  !#
    
  ;;; Commentary:
    
  ;;; Balancer provides the cache of eligible problem IDs
  ;;; to Generator. Generator then makes the final
  ;;; selection.
  ;;; Balancer maintains a rank for each possible question
  ;;; which provides the ground for selection: the lower the
  ;;; score, the more likely the question is picked.
  ;;; The rank is revised after every player attempt at solving
  ;;; the problem.
  ;;; When no ranking exists Balancer obtains the initial set
  ;;; of problem IDs from Library and assigns them a base rank.
      
  ;;; Code:
#+END_SRC
** Module Definition
#+name: module-definition
#+BEGIN_SRC scheme  
  (define-module (guilecraft balancer)
    #:export (request-tags                ; used by Generator
              ranking-put)                ; used by Controller
    #:use-module (guilecraft controller)  ; for request-current-module
                                          ; No longer to be used: module name now passed as input to generator
    #:use-module (guilecraft file-server) ; for restore-balancer-data
                                          ; Not implemented yet
    #:use-module (guilecraft library))    ; for librarian 'provide-tags access
#+END_SRC
** Request Tags: public access
**** TODO integrate (librarian 'request-current-tag-set) @ library    :basic:
**** TODO implement restore-balancer-data @ file-server :next:
***** TODO integrate request-current-module @ controller

*** Intro
Request-tags is intended to return the list of tags that qualify equally for being used to generate a question using Library's tag-based question streams. The list of tags consists of the lowest, equal ranking tags.

Characteristics to be taken into account for the ranking of tags:
- the result of the evaluations of previously posed problems for the same tag: correct answers increase the rank; incorrect answers decrease the rank.
- scheduling of tags: once a tag has reached a certain rank it will not be asked again, until a set date, at which point its rank will be dramatically reduced, resulting in its being used for question generation immediately once more.
