guilecraft/guilecraft-libs.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Generator</h3>
<div class="outline-text-3" id="text-3-3">


</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Introduction</h4>
<div class="outline-text-4" id="text-3-3-1">

<p>The role of the Generator is to obtain a question. In order to do so it obtains a list of tags from the Balancer, from which it then selects one at random (if necessary) and requests a corresponding question from the stream in the library.
</p>
<p>
Compile Question:
</p><ul>
<li>first obtains a list of low-scoring or scheduled tags from Balancer, using its exported request-tags.
</li>
<li>It then selects one of those tags, using Generator's select-tag.
</li>
<li>Finally it obtains a question from library's tag-based streams using its exported request-question.
</li>
</ul>

<p>It returns the result of this operation to its caller, normally Controller.
</p></div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Code</h4>
<div class="outline-text-4" id="text-3-3-2">

<ul>
<li id="sec-3-3-2-1"><span class="todo TODO">TODO</span> integrate request-question @ library &nbsp;&nbsp;&nbsp;<span class="tag"><span class="basic">basic</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-3-3-2-2"><span class="todo TODO">TODO</span> integrate request-tags @ balancer &nbsp;&nbsp;&nbsp;<span class="tag"><span class="basic">basic</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-3-3-2-3">Compile Question<br/>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">compile-question</span>)
    <span style="color: #4E9A06;">"Procedure which algorithmically returns one question.</span>

<span style="color: #4E9A06;">No input is necessary for this activity."</span>
    (request-question              <span style="color: #204A87;">;</span><span style="color: #204A87;">from Library</span>
     (select-tag                        <span style="color: #204A87;">;</span><span style="color: #204A87;">from Here</span>
      (request-tags))))                 <span style="color: #204A87;">;</span><span style="color: #204A87;">from Balancer</span>
</pre>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Select Tag</h3>
<div class="outline-text-3" id="text-3-4">


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Introduction</h4>
<div class="outline-text-4" id="text-3-4-1">

<p>Select Tag is a procedure to reduce a list containing one or more tags to only one tag, provided as a symbol.
</p>
<p>
One can envisage this being done through a sophisticated algorithm. For now it is simply done by picking the first tag in the list.
</p></div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Code</h4>
<div class="outline-text-4" id="text-3-4-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">select-tag</span> tag-list)
  <span style="color: #4E9A06;">"Select exactly one tag from a list of tags.</span>

<span style="color: #4E9A06;">  Input is normally a list of tags retrieved from the Balancer. Returns a single symbol that is a tag, normally used to activate a stream in the Library."</span>
    (car tag-list))
</pre>

</div>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Old Functions</h3>
<div class="outline-text-3" id="text-3-5">


</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Choose Problem</h4>
<div class="outline-text-4" id="text-3-5-1">

<p>This function has been significantly re-designed as a consequence of storing the current question through the use of streams in the Library.
(define (choose-problem mylist)
  "Procedure which algorithmically returns one of the lowest-ranking problem-IDs supplied via request-ranking.
No input is necessary for this activity."
  (car (request-ranked-ID mylist)))
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The Balancer</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-4">
<h4 id="sec-4-1"><span class="section-number-4">4.1</span> <span class="todo TODO">TODO</span> Balancer should be written to use a stream internally to generate the next set of lowest scoring tags. &nbsp;&nbsp;&nbsp;<span class="tag"><span class="architecture">architecture</span></span></h4>
<div class="outline-text-4" id="text-4-1">

</div>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Guile Documentation</h3>
<div class="outline-text-3" id="text-4-1">




<pre class="src src-scheme">coding:utf-8
!#

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Commentary:</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Balancer provides the cache of eligible problem IDs</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">to Generator. Generator then makes the final</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">selection.</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Balancer maintains a rank for each possible question</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">which provides the ground for selection: the lower the</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">score, the more likely the question is picked.</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">The rank is revised after every player attempt at solving</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">the problem.</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">When no ranking exists Balancer obtains the initial set</span>
<span style="color: #204A87;">;;; </span><span style="color: #204A87;">of problem IDs from Library and assigns them a base rank.</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Code:</span>
</pre>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Module Definition</h3>
<div class="outline-text-3" id="text-4-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define-module</span> (<span style="color: #2F8B58; font-weight: bold;">guilecraft</span> balancer)
  <span style="color: #A020F0;">#:export</span> (request-tags                <span style="color: #204A87;">; </span><span style="color: #204A87;">used by Generator</span>
            ranking-put)                <span style="color: #204A87;">; </span><span style="color: #204A87;">used by Controller</span>
  <span style="color: #A020F0;">#:use-module</span> (guilecraft controller)  <span style="color: #204A87;">; </span><span style="color: #204A87;">for request-current-module</span>
                                        <span style="color: #204A87;">; </span><span style="color: #204A87;">No longer to be used: module name now passed as input to generator</span>
  <span style="color: #A020F0;">#:use-module</span> (guilecraft file-server) <span style="color: #204A87;">; </span><span style="color: #204A87;">for restore-balancer-data</span>
                                        <span style="color: #204A87;">; </span><span style="color: #204A87;">Not implemented yet</span>
  <span style="color: #A020F0;">#:use-module</span> (guilecraft library))    <span style="color: #204A87;">; </span><span style="color: #204A87;">for librarian 'provide-tags access</span>
</pre>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Request Tags: public access</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li id="sec-4-3-1"><span class="todo TODO">TODO</span> integrate (librarian 'request-current-tag-set) @ library &nbsp;&nbsp;&nbsp;<span class="tag"><span class="basic">basic</span></span><br/>
</li>
</ul>
<ul>
<li id="sec-4-3-2"><span class="todo TODO">TODO</span> implement restore-balancer-data @ file-server &nbsp;&nbsp;&nbsp;<span class="tag"><span class="next">next</span></span><br/>
<ul>
<li id="sec-4-3-2-1"><span class="todo TODO">TODO</span> integrate request-current-module @ controller<br/>

</li>
</ul>
</li>
</ul>

</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Intro</h4>
<div class="outline-text-4" id="text-4-3-1">

<p>Request-tags is intended to return the list of tags that qualify equally for being used to generate a question using Library's tag-based question streams. The list of tags consists of the lowest, equal ranking tags.
</p>
<p>
Characteristics to be taken into account for the ranking of tags:
</p><ul>
<li>the result of the evaluations of previously posed problems for the same tag: correct answers increase the rank; incorrect answers decrease the rank.
</li>
<li>scheduling of tags: once a tag has reached a certain rank it will not be asked again, until a set date, at which point its rank will be dramatically reduced, resulting in its being used for question generation immediately once more.
</li>
</ul>

</div>

</div>
