guilecraft/guilecraft-libs.html

<div id="outline-container-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Code</h4>
<div class="outline-text-4" id="text-4-3-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-tags</span> module-list)
    <span style="color: #4E9A06;">"Initiate the rank table if necessary and call lowest-ranking-from-table to obtain a list of lowest ranking problems.</span>
<span style="color: #4E9A06;">Request-tags needs a list of the modules currently played, and returns a list of the tags from those modules that score the lowest rank."</span>
    (<span style="color: #A52A2A; font-weight: bold;">let</span> ((local-list '()))
      (<span style="color: #A52A2A; font-weight: bold;">cond</span> (<span style="color: #A52A2A; font-weight: bold;">or</span> (not (eq? local-list module-list))
                (eq? rank-table '())
             (populate-rank-table (librarian 'provide-tags module-list))
             (lowest-ranking-from-table rank-table 0 5 (list)))
            (<span style="color: #A52A2A; font-weight: bold;">else</span> 
             (lowest-ranking-from-table rank-table 0 5 (list))))))
</pre>

</div>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Helper Functions: initial population and retrieving the lowest ranking set</h3>
<div class="outline-text-3" id="text-4-4">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">populate-rank-table</span> tag-set)
  <span style="color: #4E9A06;">"Procedure which initially populates the rank-table. It is pure side-effect, and could be called by a hook.</span>

<span style="color: #4E9A06;">  populate-rank-table requires the set of problem-IDs which it will populate the table with, as well as a default rank to assign them with.</span>

<span style="color: #4E9A06;">  Improvements:</span>
<span style="color: #4E9A06;">  - must be capable of restoring ranking across sessions -&gt; data persistence</span>
<span style="color: #4E9A06;">  - currently state-ful solution: either call it through a hook or implement a functional solution."</span>
  (<span style="color: #A52A2A; font-weight: bold;">for-each</span> (<span style="color: #A52A2A; font-weight: bold;">lambda</span> (tag)      <span style="color: #204A87;">; </span><span style="color: #204A87;">tag-set is split into its atoms: tags</span>
              (set! rank-table
                    (acons tag 
                           100 
                           rank-table)))
            tag-set))

</pre>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">lowest-ranking-from-table</span> 
         rank-table          <span style="color: #204A87;">; </span><span style="color: #204A87;">The state-based rank-table</span>
         tag-reference       <span style="color: #204A87;">; </span><span style="color: #204A87;">The reference of tag currently examined</span>
         lowest-rank         <span style="color: #204A87;">; </span><span style="color: #204A87;">The lowest rank so far</span>
         lowest-ranking-tag-set) <span style="color: #204A87;">; </span><span style="color: #204A87;">The tags with the lowest rank so far</span>
  <span style="color: #4E9A06;">"Simple procedure to retrieve the question-IDs with the lowest rank from rank-table.</span>

<span style="color: #4E9A06;">  Improvements:</span>
<span style="color: #4E9A06;">  - Implement a way to keep track of the current lowest rank: eliminates the need for searching the entire table recursively &#8212; instead we simply search it for any problem-IDs matching the lowest score. We could then substitute the complicated cond below for a simple map lowest-ranking? rank-table."</span>
  (<span style="color: #A52A2A; font-weight: bold;">if</span> (= (length rank-table)
         tag-reference)
      lowest-ranking-tag-set
      (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((= (cdr (list-ref 
                      rank-table
                      tag-reference)) 
                lowest-rank)
             (lowest-ranking-from-table rank-table 
                                        (+ tag-reference 1)
                                        lowest-rank
                                        (append lowest-ranking-tag-set (list (car (list-ref rank-table tag-reference))))))
            ((&lt; (cdr (list-ref 
                      rank-table 
                      tag-reference))
                lowest-rank)
             (lowest-ranking-from-table rank-table
                                        (+ tag-reference 1)
                                        (cdr (list-ref rank-table tag-reference))
                                        (list (car (list-ref rank-table tag-reference)))))
            (<span style="color: #A52A2A; font-weight: bold;">else</span> (lowest-ranking-from-table rank-table
                                             (+ tag-reference 1)
                                             lowest-rank
                                             lowest-ranking-tag-set)))))
</pre>

</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Updating the rank-table</h3>
<div class="outline-text-3" id="text-4-5">


</div>

<div id="outline-container-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Code:</h4>
<div class="outline-text-4" id="text-4-5-1">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">ranking-put</span> tag evaluation)
  <span style="color: #4E9A06;">"Procedure to update the current ranking of a given problem-ID on the basis of the evaluation of the player's answer to the challenge.</span>

<span style="color: #4E9A06;">  ranking-put requires the problem-ID that it will update and the result of the evaluation, with which it modifies the rank. It returns evaluation, as this function serves purely for its side-effect.</span>

<span style="color: #4E9A06;">  Improvements:</span>
<span style="color: #4E9A06;">  - call ranking-put via a hook if I decide to use the state based approach: this would tidy the code.</span>
<span style="color: #4E9A06;">  - do away with ranking-put after devising a functional solution to problem-ID ranking."</span>
  (<span style="color: #A52A2A; font-weight: bold;">begin</span>
    (assq-set! rank-table 
               tag 
               (calculate-new-rank (assq-ref rank-table tag)  <span style="color: #204A87;">; </span><span style="color: #204A87;">assq-ref returns the value of tag</span>
                                   evaluation))
    evaluation))

(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">calculate-new-rank</span> rank-table-value evaluation)
  <span style="color: #4E9A06;">"The actual algorithm used to obtain a new rank.</span>

<span style="color: #4E9A06;">  calculate-new-rank requires a the key of a value in the rank-table and the result of the evaluation of the player's answer, and returns the new ranking for that key in the rank-table."</span>
  (<span style="color: #A52A2A; font-weight: bold;">cond</span> (evaluation (+ rank-table-value 1))
        (<span style="color: #A52A2A; font-weight: bold;">else</span> (- rank-table-value 1))))
</pre>

</div>
</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> State: rank-table</h3>
<div class="outline-text-3" id="text-4-6">

<p>Currently balancer uses a state variable, alist, to maintain its ranking:
</p>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> <span style="color: #00578E; font-weight: bold;">rank-table</span> (list))
</pre>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> The Library</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Guile Documentation</h3>
<div class="outline-text-3" id="text-5-1">




<pre class="src src-scheme">coding:utf-8
!#

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Commentary:</span>

<span style="color: #204A87;">;; </span><span style="color: #204A87;">library handles all in-game module data. </span>
<span style="color: #204A87;">;; </span><span style="color: #204A87;">Library stores in-game module and level data, </span>
<span style="color: #204A87;">;; </span><span style="color: #204A87;">- requests information from fs handler on load</span>
<span style="color: #204A87;">;; </span><span style="color: #204A87;">- pushes information to fs handler for writing</span>
<span style="color: #204A87;">;; </span><span style="color: #204A87;">Is asked for info by question evaluator, weighting </span>
<span style="color: #204A87;">;; </span><span style="color: #204A87;">system question generator.</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Code:</span>
</pre>

</div>

</div>
