guilecraft/guilecraft-libs.org
** Module Definition
#+name: module-definition
#+begin_src scheme
  (define-module (guilecraft library)
    #:export (librarian          ;used by Balancer, Generator, Evaluator
              )
    #:use-module (guilecraft data-types)
    #:use-module (guilecraft file-server))
  #+end_src
** Librarian:
Librarian is the exposed library module function. It is called with a COMMAND, and potentially with a parameter, if the command requires it.
Librarian is a dispatcher, which then proceeds to execute the required functions that retrieve the requested information from the Library.
#+name: librarian
#+begin_src scheme
  (define (librarian command . parameters)
    "Scans an incoming request for @var{command} and invokes the correct procedure to resolve it.
  
  @var{parameters} must be:
  - a tag, if the command is 'provide-question or 'provide-solution
  - a module, if the command is 'build-library.
  
  'provide-tags is a thunk that simply returns all tags currently providing a stream within the library."
    (cond ((provide-tags? command)
           (retrieve-current-tag-set))
          ((provide-question? command) 
           (retrieve-current-question parameter))
          ((provide-solution? command)
           (retrieve-current-solution))
          ((build-library? command)
           (build-library parameter))
          (else #f)))
#+end_src
Library provides the data for all things module. It provides:
- a current list of active tags, through RETRIEVE-CURRENT-TAG-SET
- one stream per active tag, providing through this an interface to problem data, sorted by tag.
The streams are accessed by calling LIBRARIAN with with the PROVIDE-QUESTION or PROVIDE-SOLUTION commands, both of which require a tag as a parameter. Librarian will then call either RETRIEVE-CURRENT-QUESTION or RETRIEVE-CURRENT-SOLUTION to obtain data from the streams corresponding to the tag in question.
Whenever new data needs to be added to the library, the BUILD-LIBRARY command is issued. It updates the list of active tags
#+name: library
#+BEGIN_SRC scheme  
  (define (retrieve-current-tag-set)
      '())
#+END_SRC
#+name: predicates
#+BEGIN_SRC scheme
    ;; Commands:
    (define (provide-level? subject)
      (eqv? 'provide-level subject))
    (define (provide-tags? subject)
      (eqv? 'provide-tags subject))
    (define (provide-question? subject)
      (eqv? 'provide-question subject))
    (define (provide-solution? subject)
      (eqv? 'provide-solution subject))
    (define (build-library? subject)
      (eqv? 'build-library subject))
#+END_SRC
** Library
#+begin_src scheme
  
  (define (request-problem-ID-set mylist)
    "Procedure used by Balancer to obtain the initial list of problem-IDs in use for the duration of this session. This list needs to be refreshed when a different module or level is chosen.
  GAP IN LOGIC.
  problem-IDs are simply the index to the list of problems in the problems holder problems below."
    (create-list-ID-set (length mylist) 0 (list)))
#+end_src

#+begin_src scheme
(define (create-list-ID-set list-length counter problem-ID-set)
  (cond ((= counter list-length)
	 problem-ID-set)
	((create-list-ID-set list-length
			      (+ counter 1)
			      (append problem-ID-set (list counter))))))
#+end_src

#+begin_src scheme 
(define (request-question problem-ID)
  "Procedure used by Generator to obtain the question to ask the player after selecting one.
List of suitable problem-IDs will have been provided to Generator by Balancer."
  (question (list-ref problems problem-ID)))

#+end_src

#+begin_src scheme 
(define (request-solution problem-ID)
  "Procedure used by Evaluator to obtain the solution to the problem posed to the player after the player has attempted to answer thus.
problem-ID is provided by Generator to Evaluator upon request, after which Evaluator requests the solution from Library."
  (solution (list-ref problems problem-ID)))

#+end_src

** Library as a stream
A new experiment is to let library provide sets of problems through a stream. This paves the way for providing 'dynamic problems', which describe the rules for generating problems rather than explicitly programming the individual problems. Using streams preserves the ability to use 'programmed' problems.
#+name: stream-provider
#+BEGIN_SRC scheme  
  (define (stream-element-selector target-element state stream) 
    "Pick an @var{target-element} that is a member of a @var{stream}.
  Target element is essentially the index reference for the desired element of the stream."
    (if (= state target-element)
        (stream-car stream)
        (stream-element-selector target-element (+ state 1) (stream-cdr stream))))
  #+END_SRC
