guilecraft/guilecraft-libs.html

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Module Definition</h3>
<div class="outline-text-3" id="text-5-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define-module</span> (<span style="color: #2F8B58; font-weight: bold;">guilecraft</span> library)
  <span style="color: #A020F0;">#:export</span> (librarian          <span style="color: #204A87;">;</span><span style="color: #204A87;">used by Balancer, Generator, Evaluator</span>
            )
  <span style="color: #A020F0;">#:use-module</span> (guilecraft data-types)
  <span style="color: #A020F0;">#:use-module</span> (guilecraft file-server))
</pre>

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Librarian:</h3>
<div class="outline-text-3" id="text-5-3">

<p>Librarian is the exposed library module function. It is called with a COMMAND, and potentially with a parameter, if the command requires it.
Librarian is a dispatcher, which then proceeds to execute the required functions that retrieve the requested information from the Library.
</p>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">librarian</span> command . parameters)
  <span style="color: #4E9A06;">"Scans an incoming request for @var{command} and invokes the correct procedure to resolve it.</span>

<span style="color: #4E9A06;">@var{parameters} must be:</span>
<span style="color: #4E9A06;">- a tag, if the command is 'provide-question or 'provide-solution</span>
<span style="color: #4E9A06;">- a module, if the command is 'build-library.</span>

<span style="color: #4E9A06;">'provide-tags is a thunk that simply returns all tags currently providing a stream within the library."</span>
  (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((provide-tags? command)
         (retrieve-current-tag-set))
        ((provide-question? command) 
         (retrieve-current-question parameter))
        ((provide-solution? command)
         (retrieve-current-solution))
        ((build-library? command)
         (build-library parameter))
        (<span style="color: #A52A2A; font-weight: bold;">else</span> #f)))
</pre>

<p>
Library provides the data for all things module. It provides:
</p><ul>
<li>a current list of active tags, through RETRIEVE-CURRENT-TAG-SET
</li>
<li>one stream per active tag, providing through this an interface to problem data, sorted by tag.
</li>
</ul>

<p>The streams are accessed by calling LIBRARIAN with with the PROVIDE-QUESTION or PROVIDE-SOLUTION commands, both of which require a tag as a parameter. Librarian will then call either RETRIEVE-CURRENT-QUESTION or RETRIEVE-CURRENT-SOLUTION to obtain data from the streams corresponding to the tag in question.
Whenever new data needs to be added to the library, the BUILD-LIBRARY command is issued. It updates the list of active tags
</p>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">retrieve-current-tag-set</span>)
    ())
</pre>


<pre class="src src-scheme"><span style="color: #204A87;">;; </span><span style="color: #204A87;">Commands:</span>
(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">provide-level?</span> subject)
  (eqv? 'provide-level subject))
(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">provide-tags?</span> subject)
  (eqv? 'provide-tags subject))
(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">provide-question?</span> subject)
  (eqv? 'provide-question subject))
(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">provide-solution?</span> subject)
  (eqv? 'provide-solution subject))
(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">build-library?</span> subject)
  (eqv? 'build-library subject))
</pre>

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Library</h3>
<div class="outline-text-3" id="text-5-4">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-problem-ID-set</span> mylist)
  <span style="color: #4E9A06;">"Procedure used by Balancer to obtain the initial list of problem-IDs in use for the duration of this session. This list needs to be refreshed when a different module or level is chosen.</span>
<span style="color: #4E9A06;">GAP IN LOGIC.</span>
<span style="color: #4E9A06;">problem-IDs are simply the index to the list of problems in the problems holder problems below."</span>
  (create-list-ID-set (length mylist) 0 (list)))
</pre>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">create-list-ID-set</span> list-length counter problem-ID-set)
  (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((= counter list-length)
         problem-ID-set)
        ((create-list-ID-set list-length
                              (+ counter 1)
                              (append problem-ID-set (list counter))))))
</pre>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-question</span> problem-ID)
  <span style="color: #4E9A06;">"Procedure used by Generator to obtain the question to ask the player after selecting one.</span>
<span style="color: #4E9A06;">List of suitable problem-IDs will have been provided to Generator by Balancer."</span>
  (question (list-ref problems problem-ID)))

</pre>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-solution</span> problem-ID)
  <span style="color: #4E9A06;">"Procedure used by Evaluator to obtain the solution to the problem posed to the player after the player has attempted to answer thus.</span>
<span style="color: #4E9A06;">problem-ID is provided by Generator to Evaluator upon request, after which Evaluator requests the solution from Library."</span>
  (solution (list-ref problems problem-ID)))

</pre>


</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Library as a stream</h3>
<div class="outline-text-3" id="text-5-5">

<p>A new experiment is to let library provide sets of problems through a stream. This paves the way for providing 'dynamic problems', which describe the rules for generating problems rather than explicitly programming the individual problems. Using streams preserves the ability to use 'programmed' problems.
</p>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">stream-element-selector</span> target-element state stream) 
  <span style="color: #4E9A06;">"Pick an @var{target-element} that is a member of a @var{stream}.</span>
<span style="color: #4E9A06;">Target element is essentially the index reference for the desired element of the stream."</span>
  (<span style="color: #A52A2A; font-weight: bold;">if</span> (= state target-element)
      (stream-car stream)
      (stream-element-selector target-element (+ state 1) (stream-cdr stream))))
</pre>

</div>

</div>
