guilecraft/guilecraft-libs.org
** Old functions:
   :PROPERTIES:
   :tangle:   no
   :END:
#+begin_src scheme
  
  (define (request-problem-ID-set mylist)
    "Procedure used by Balancer to obtain the initial list of problem-IDs in use for the duration of this session. This list needs to be refreshed when a different module or level is chosen.
  GAP IN LOGIC.
  problem-IDs are simply the index to the list of problems in the problems holder problems below."
    (create-list-ID-set (length mylist) 0 (list)))
#+end_src

#+begin_src scheme
(define (create-list-ID-set list-length counter problem-ID-set)
  (cond ((= counter list-length)
	 problem-ID-set)
	((create-list-ID-set list-length
			      (+ counter 1)
			      (append problem-ID-set (list counter))))))
#+end_src

#+begin_src scheme 
(define (request-tag problem-ID)
  "Procedure used by Balancer to obtain the tags corresponding to the problem-IDs supplied to it by library through request-problem-ID-set. The tags are used to group problems together. Balancing scores are applied to tags rather than individual problems."
  (tag (list-ref problems problem-ID)))

#+end_src

#+begin_src scheme 
(define (request-question problem-ID)
  "Procedure used by Generator to obtain the question to ask the player after selecting one.
List of suitable problem-IDs will have been provided to Generator by Balancer."
  (question (list-ref problems problem-ID)))

#+end_src

#+begin_src scheme 
(define (request-solution problem-ID)
  "Procedure used by Evaluator to obtain the solution to the problem posed to the player after the player has attempted to answer thus.
problem-ID is provided by Generator to Evaluator upon request, after which Evaluator requests the solution from Library."
  (solution (list-ref problems problem-ID)))

#+end_src
* The File Server
  :PROPERTIES:
  :tangle:   ./file-server.scm
  :END:
** Introduction
The file server is supposed to act as an interface between guilecraft's internal data-structure and the persistent/backup data that is stored in XML format on the filesystem. Examples of data stored in the filesystem are:
- modules (levels, problems, achievements)
- user-serv (not implemented yet: user profile information such as authentication)
- statistics (not implemented yet, but essential for the balancing algorithms and for user introspection)
- user-profile (not implemented yet: user profile data that tracks module and learning progress and ties achievements to profiles)
All xml/sxml processing takes place within the file-server.
*** When is file-server used?
Guilecraft is designed in such a way that files are only read from the file-server when absolutely necessary. This will either be when information is accessed for the first time (e.g. when the player has chosen a module to play, and that module has not previously been accessed by the running instance of Guilecraft).
Selector components, for instance module-selection or profile-selection, always request a latest version from the file-server, to allow for revisions of loaded modules or profiles.
*** Guilecraft is non-destructive
Guilecraft is written in the functional paradigm and is non-destructive in relation to data it stores on the file-system. 
- Cleaning functions need to be provided, to remove 'obsolete' data as and when required, without threatening the capabilities of Guilecraft (rollback, looking back in history, etc.).
- file-server needs to have a means of establishing what 'version' of the files it is accessing it needs to access. By default file-server will always work with the 'current' version, that is the latest version available. A method must be provided to fall-back to prior versions.
- this method is likely to be a system of symlinks.
** Module definition
  :PROPERTIES:
  :tangle:   ./file-server.scm
  :END:
#+name: file-server-definition
#+begin_src scheme :shebang "#! /usr/bin/guile -s"
  coding:utf-8
  !#

  (define-module (guilecraft file-server)
    #:export (get-from-file-server)
    #:use-module (sxml ssax))
  #+end_src
** Entrance — get-from-file-server, put-on-file-server and select-from-file-server:
  :PROPERTIES:
  :tangle:   ./file-server.scm
  :END:
All queries to the file-server enter through one of three functions:
- [[get-from-file-server]]
- [[put-on-file-server]]
- [[select-from-file-server]]
*** get-from-file-server
Gffs calls procedures within this module as needed in order to return a guile data-type (probably in the form of vlists) to the caller. 
The first task to be carried out by gffs is to correlate the provided "what" symbol with a filesystem path. To this end gffs calls resolve-path, which in turn should call gffs, this time with a path in "what's" place.
Gffs is then able to call get-data with a path to actually retrieve the data and have it return the data-type to return to the file-server caller.
#+name: get-from-file-server
#+begin_src scheme
  (define (get-from-file-server what . who)
    "Exported function returning the contents of an xml guilecraft config file in sxml.
  
  Requires a recognised target to fetch, as symbol from a list, and, depending on the target, a further argument that specifies the sub-location to fetch.
  
  get-from-file-server returns the data requested or 'fail"
    (cond ((not (eqv? '() who))
           (resolve-path what who))
          ((symbol? what)
           (resolve-path what))
          (else (get-data what))))
#+end_src
**** get-data
get-data actually opens a file as input port and calls the ssax xml parser on the file and returns an sxml list. As expected it exits on error.

The only responsibility of get-data is to return the list, so it can be passed back to the component that requested file-system information. That component then needs to analyse the returned list and convert it into data it can use.

The benefit is that get-data does not need to concern itself with the Guilecraft internal representation of component objects, and conversely, the internal components need not concern themselves with the file-system or sxml.

#+name: get-data
#+begin_src scheme
  (define (get-data uri)
    "requires uri to Guilecraft XML file, returns a list with the elements of that file."
    (xml->sxml (open-input-file uri)))
#+end_src
