guilecraft/guilecraft-libs.html

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Old functions:</h3>
<div class="outline-text-3" id="text-5-6">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-problem-ID-set</span> mylist)
  <span style="color: #4E9A06;">"Procedure used by Balancer to obtain the initial list of problem-IDs in use for the duration of this session. This list needs to be refreshed when a different module or level is chosen.</span>
<span style="color: #4E9A06;">GAP IN LOGIC.</span>
<span style="color: #4E9A06;">problem-IDs are simply the index to the list of problems in the problems holder problems below."</span>
  (create-list-ID-set (length mylist) 0 (list)))
</pre>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">create-list-ID-set</span> list-length counter problem-ID-set)
  (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((= counter list-length)
         problem-ID-set)
        ((create-list-ID-set list-length
                              (+ counter 1)
                              (append problem-ID-set (list counter))))))
</pre>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-tag</span> problem-ID)
  <span style="color: #4E9A06;">"Procedure used by Balancer to obtain the tags corresponding to the problem-IDs supplied to it by library through request-problem-ID-set. The tags are used to group problems together. Balancing scores are applied to tags rather than individual problems."</span>
  (tag (list-ref problems problem-ID)))

</pre>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-question</span> problem-ID)
  <span style="color: #4E9A06;">"Procedure used by Generator to obtain the question to ask the player after selecting one.</span>
<span style="color: #4E9A06;">List of suitable problem-IDs will have been provided to Generator by Balancer."</span>
  (question (list-ref problems problem-ID)))

</pre>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">request-solution</span> problem-ID)
  <span style="color: #4E9A06;">"Procedure used by Evaluator to obtain the solution to the problem posed to the player after the player has attempted to answer thus.</span>
<span style="color: #4E9A06;">problem-ID is provided by Generator to Evaluator upon request, after which Evaluator requests the solution from Library."</span>
  (solution (list-ref problems problem-ID)))

</pre>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> The File Server</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Introduction</h3>
<div class="outline-text-3" id="text-6-1">

<p>The file server is supposed to act as an interface between guilecraft's internal data-structure and the persistent/backup data that is stored in XML format on the filesystem. Examples of data stored in the filesystem are:
</p><ul>
<li>modules (levels, problems, achievements)
</li>
<li>user-serv (not implemented yet: user profile information such as authentication)
</li>
<li>statistics (not implemented yet, but essential for the balancing algorithms and for user introspection)
</li>
<li>user-profile (not implemented yet: user profile data that tracks module and learning progress and ties achievements to profiles)
</li>
</ul>

<p>All xml/sxml processing takes place within the file-server.
</p>
</div>

<div id="outline-container-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> When is file-server used?</h4>
<div class="outline-text-4" id="text-6-1-1">

<p>Guilecraft is designed in such a way that files are only read from the file-server when absolutely necessary. This will either be when information is accessed for the first time (e.g. when the player has chosen a module to play, and that module has not previously been accessed by the running instance of Guilecraft).
Selector components, for instance module-selection or profile-selection, always request a latest version from the file-server, to allow for revisions of loaded modules or profiles.
</p></div>

</div>

<div id="outline-container-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> Guilecraft is non-destructive</h4>
<div class="outline-text-4" id="text-6-1-2">

<p>Guilecraft is written in the functional paradigm and is non-destructive in relation to data it stores on the file-system. 
</p><ul>
<li>Cleaning functions need to be provided, to remove 'obsolete' data as and when required, without threatening the capabilities of Guilecraft (rollback, looking back in history, etc.).
</li>
<li>file-server needs to have a means of establishing what 'version' of the files it is accessing it needs to access. By default file-server will always work with the 'current' version, that is the latest version available. A method must be provided to fall-back to prior versions.
</li>
<li>this method is likely to be a system of symlinks.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Module definition</h3>
<div class="outline-text-3" id="text-6-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define-module</span> (<span style="color: #2F8B58; font-weight: bold;">guilecraft</span> file-server)
  <span style="color: #A020F0;">#:export</span> (get-from-file-server)
  <span style="color: #A020F0;">#:use-module</span> (sxml ssax))
</pre>

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Entrance — get-from-file-server, put-on-file-server and select-from-file-server:</h3>
<div class="outline-text-3" id="text-6-3">

<p>All queries to the file-server enter through one of three functions:
</p><ul>
<li><a href="#get-from-file-server">get-from-file-server</a>
</li>
<li><a href="#put-on-file-server">put-on-file-server</a>
</li>
<li><a href="#sec-6-3-3">select-from-file-server</a>
</li>
</ul>


</div>

<div id="outline-container-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> get-from-file-server</h4>
<div class="outline-text-4" id="text-6-3-1">

<p>Gffs calls procedures within this module as needed in order to return a guile data-type (probably in the form of vlists) to the caller. 
The first task to be carried out by gffs is to correlate the provided "what" symbol with a filesystem path. To this end gffs calls resolve-path, which in turn should call gffs, this time with a path in "what's" place.
Gffs is then able to call get-data with a path to actually retrieve the data and have it return the data-type to return to the file-server caller.
</p>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">get-from-file-server</span> what . who)
  <span style="color: #4E9A06;">"Exported function returning the contents of an xml guilecraft config file in Guile data-format.</span>

<span style="color: #4E9A06;">Requires a recognised target to fetch, as symbol from a list, and, depending on the target, a further argument that specifies the sub-location to fetch.</span>

<span style="color: #4E9A06;">get-from-file-server returns the data requested or 'fail"</span>
  (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((not (eqv? '() who))
         (resolve-path what who))
        ((symbol? what)
         (resolve-path what))
        (<span style="color: #A52A2A; font-weight: bold;">else</span> (get-data what))))
</pre>

<ul>
<li id="sec-6-3-1-1">get-data<br/>
get-data actually opens a file as input port and calls the ssax xml parser on the file and returns an sxml list. As expected it exits on error.

<p>
The only responsibility of get-data is to return the list, so it can be passed back to the component that requested file-system information. That component then needs to analyse the returned list and convert it into data it can use.
</p>
<p>
The benefit is that get-data does not need to concern itself with the Guilecraft internal representation of component objects, and conversely, the internal components need not concern themselves with the file-system or sxml.
</p>
<p>
While file-server won't return 'invalid XML data', it could still return gobbledygook from the component's perspective (e.g. non-valid Guilecraft question types). Components need to perform validation.
</p>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">get-data</span> uri)
  <span style="color: #4E9A06;">"requires uri to Guilecraft XML file, returns a list with the elements of that file."</span>
  (ssax:xml-&gt;sxml (open-input-file uri) '())
  )
</pre>

</li>
</ul>
</div>

</div>
