guilecraft/guilecraft-libs.org
*** put-on-file-server
Pofs is the persistent data saving component of Guilecraft. It should require a Guile data-type (probably vlist) a "what" symbol and, depending on "what" is being saved, a "who" symbol.
#+name: put-on-file-server
#+begin_src scheme
  (define (put-on-file-server data what . who)
    "put-on-file-server stores DATA as WHAT on the filesystem. WHAT and WHO are used to determine the path of the xml file in which the data is to be stored.
  
  Put-on-file-server is called for its side-effect. It returns 'success or 'fail.")
#+end_src 
*** select-from-file-server
sffs fulfills two roles:
- it provides data that can be used by interfaces to provide menus to users
- it makes Guilecraft aware of newer versions of data stored on the file-system, thus allowing in-session dynamic re-loading of data.
*** Helper functions
This section details a number of helper functions that are used by the root functions described above.
**** resolve-path
rp expects a WHAT symbol and returns the associated path.
When the WHAT symbol is module or user the additional symbol WHO is employed to establish the full path to be returned.
#+name: resolve-path
#+begin_src scheme
  (define (resolve-path what . who)
  "Generates the appropriate URI for get-data to import the file's XML as SXML.
  "
    (cond ((eqv? what 'user-serv)
           "users/user-serv.xml")
          ((eqv? what 'statistics)
           "statistics/statistics.xml")
          ((not (eqv? '() who))
           (cond ((eqv? what 'module)
                  (string-append "modules/" (symbol->string (car who)) "/module.xml"))
                 ((eqv? what 'user-profile)
                  (string-append "modules/" (symbol->string (car who)) "/user.xml"))
                 (else 'who-but-not-what)))
          (else 'not-a-recognised-symbol)))
#+end_src
* The Data Types
  :PROPERTIES:
  :tangle:   ./data-types.scm
  :END:
** Guile Documentation
First, the documentation segment, which serves to create the basic live documentation which can be called whilst hacking guilecraft, by calling (help (guilecraft data-types)).
#+name: documentation
#+begin_src scheme :shebang "#! /usr/bin/guile -s"
  coding:utf-8
  !#
  
  ;;; Commentary:
  
  ;; Data-types defines the creators and selectors
  ;; used throughout guilecraft. It is loaded by
  ;; all other modules.
  
  ;;; Code:
#+end_src
** Module Definition
Then, exporting the data types to be used throughout the rest of guilecraft. Not all data-types are exported as many of the basic types are only used by the procedures used to create the more advanced data-types.
#+name: module-definition
#+begin_src scheme
  (define-module (guilecraft data-types)
    #:export (make-gc-module
              make-level
              make-problem
              make-question
              make-solution
              make-tag
              gc-module?
              level?
              problem?
              question?
              solution?
              tag?
              level
              problem
              question
              solution
              tag
              type
              content))
  #+end_src
** Creators
*** Question
#+name: question-creator
#+begin_src scheme 
(define (make-question content)
  "Fundamental data type."
  (cons 'question content)) 
#+end_src

*** Solution
#+name: solution-creator
#+begin_src scheme
(define (make-solution content)
  "Fundamental data type carrying the value of the right answer for a problem."
  (cons 'solution content)) 
#+end_src
*** Tag
#+name: tag-creator
#+begin_src scheme
(define (make-tag content)
  "Fundamental data-type carrying meta-data about a problem, allowing problems to be grouped by problem area.

Example: two problems, (+ 2 2) and (+ 7 10), might both have the tag 'addition, as both are instances of that operation."
  (cons 'tag content)) 
#+end_src
*** Problems
**** Open Problems
#+name: open-problem-creator
#+begin_src scheme
  (define (make-open-problem question solution tag)
    "Open-problem compound data-type creator. 
  Open problems are a type of problem. Problems are the fundamental data-type used in interactions with users. At heart they consist of a question, a solution and a tag for grouping different problems together. Problems are subsumed within levels and modules in turn."
    (list 'problem question solution tag))
#+end_src
*** Level
#+name: level-creator
#+begin_src scheme
  (define (make-level . problems)
    "Level compound data-type creator. 
  Levels are logical groupings of problems for guilecraft. They consist of any number of problems which are combined to set a soft limit to the number of problems that are added to the balancing algorithm at any one time."
    (cons 'level problems))
#+end_src
*** Module
#+name: guilecraft-module-creator
#+begin_src scheme
  (define (make-gc-module . levels)
    "Module compound data-type creator. 
  Modules are the primary way by which sets of problems, through the grouping of levels, are linked into a whole in Guilecraft. Modules consist of any number of levels.
Modules should be thought of as narrating devices which provide a context through which users can engage with study materials."
    (cons 'module levels))
 #+end_src
