guilecraft/guilecraft-libs.html

<div id="outline-container-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> put-on-file-server</h4>
<div class="outline-text-4" id="text-6-3-2">

<p>Pofs is the persistent data saving component of Guilecraft. It should require a Guile data-type (probably vlist) a "what" symbol and, depending on "what" is being saved, a "who" symbol.
</p>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">put-on-file-server</span> data what . who)
  <span style="color: #4E9A06;">"put-on-file-server stores DATA as WHAT on the filesystem. WHAT and WHO are used to determine the path of the xml file in which the data is to be stored.</span>

<span style="color: #4E9A06;">Put-on-file-server is called for its side-effect. It returns 'success or 'fail."</span>)
</pre>

</div>

</div>

<div id="outline-container-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> select-from-file-server</h4>
<div class="outline-text-4" id="text-6-3-3">

<p>sffs fulfills two roles:
</p><ul>
<li>it provides data that can be used by interfaces to provide menus to users
</li>
<li>it makes Guilecraft aware of newer versions of data stored on the file-system, thus allowing in-session dynamic re-loading of data.
</li>
</ul>

</div>

</div>

<div id="outline-container-6-3-4" class="outline-4">
<h4 id="sec-6-3-4"><span class="section-number-4">6.3.4</span> Helper functions</h4>
<div class="outline-text-4" id="text-6-3-4">

<p>This section details a number of helper functions that are used by the root functions described above.
</p><ul>
<li id="sec-6-3-4-1">resolve-path<br/>
rp expects a WHAT symbol and returns the associated path.
When the WHAT symbol is module or user the additional symbol WHO is employed to establish the full path to be returned.



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">resolve-path</span> what . who)
  (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((not (symbol? what))
         'what-not-symbol)
        ((eqv? what 'user-serv)
         <span style="color: #4E9A06;">"users/user-serv.xml"</span>)
        ((eqv? what 'statistics)
         <span style="color: #4E9A06;">"statistics/statistics.xml"</span>)
        ((not (eqv? '() who))
         (<span style="color: #A52A2A; font-weight: bold;">cond</span> ((eqv? what 'module)
                (string-append <span style="color: #4E9A06;">"modules/"</span> (symbol-&gt;string (car who)) <span style="color: #4E9A06;">"/module.xml"</span>))
               ((eqv? what 'user-profile)
                (string-append <span style="color: #4E9A06;">"modules/"</span> (symbol-&gt;string (car who)) <span style="color: #4E9A06;">"/user.xml"</span>))
               (<span style="color: #A52A2A; font-weight: bold;">else</span> 'who-but-not-what)))
        (<span style="color: #A52A2A; font-weight: bold;">else</span> 'not-a-recognised-symbol)))
</pre>

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> The Data Types</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Guile Documentation</h3>
<div class="outline-text-3" id="text-7-1">

<p>First, the documentation segment, which serves to create the basic live documentation which can be called whilst hacking guilecraft, by calling (help (guilecraft data-types)).
</p>


<pre class="src src-scheme">coding:utf-8
!#

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Commentary:</span>

<span style="color: #204A87;">;; </span><span style="color: #204A87;">Data-types defines the creators and selectors</span>
<span style="color: #204A87;">;; </span><span style="color: #204A87;">used throughout guilecraft. It is loaded by</span>
<span style="color: #204A87;">;; </span><span style="color: #204A87;">all other modules.</span>

<span style="color: #204A87;">;;; </span><span style="color: #204A87;">Code:</span>
</pre>

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Module Definition</h3>
<div class="outline-text-3" id="text-7-2">

<p>Then, exporting the data types to be used throughout the rest of guilecraft. Not all data-types are exported as many of the basic types are only used by the procedures used to create the more advanced data-types.
</p>


<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define-module</span> (<span style="color: #2F8B58; font-weight: bold;">guilecraft</span> data-types)
  <span style="color: #A020F0;">#:export</span> (make-gc-module
            make-level
            make-problem
            make-question
            make-solution
            make-tag
            gc-module?
            level?
            problem?
            question?
            solution?
            tag?
            level
            problem
            question
            solution
            tag
            type
            content))
</pre>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Creators</h3>
<div class="outline-text-3" id="text-7-3">


</div>

<div id="outline-container-7-3-1" class="outline-4">
<h4 id="sec-7-3-1"><span class="section-number-4">7.3.1</span> Question</h4>
<div class="outline-text-4" id="text-7-3-1">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">make-question</span> content)
  <span style="color: #4E9A06;">"Fundamental data type."</span>
  (cons 'question content)) 
</pre>


</div>

</div>

<div id="outline-container-7-3-2" class="outline-4">
<h4 id="sec-7-3-2"><span class="section-number-4">7.3.2</span> Solution</h4>
<div class="outline-text-4" id="text-7-3-2">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">make-solution</span> content)
  <span style="color: #4E9A06;">"Fundamental data type carrying the value of the right answer for a problem."</span>
  (cons 'solution content)) 
</pre>

</div>

</div>

<div id="outline-container-7-3-3" class="outline-4">
<h4 id="sec-7-3-3"><span class="section-number-4">7.3.3</span> Tag</h4>
<div class="outline-text-4" id="text-7-3-3">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">make-tag</span> content)
  <span style="color: #4E9A06;">"Fundamental data-type carrying meta-data about a problem, allowing problems to be grouped by problem area.</span>

<span style="color: #4E9A06;">Example: two problems, (+ 2 2) and (+ 7 10), might both have the tag 'addition, as both are instances of that operation."</span>
  (cons 'tag content)) 
</pre>

</div>

</div>

<div id="outline-container-7-3-4" class="outline-4">
<h4 id="sec-7-3-4"><span class="section-number-4">7.3.4</span> Problems</h4>
<div class="outline-text-4" id="text-7-3-4">

<ul>
<li id="sec-7-3-4-1">Open Problems<br/>



<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">make-open-problem</span> question solution tag)
  <span style="color: #4E9A06;">"Open-problem compound data-type creator. </span>
<span style="color: #4E9A06;">Open problems are a type of problem. Problems are the fundamental data-type used in interactions with users. At heart they consist of a question, a solution and a tag for grouping different problems together. Problems are subsumed within levels and modules in turn."</span>
  (list 'problem question solution tag))
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-7-3-5" class="outline-4">
<h4 id="sec-7-3-5"><span class="section-number-4">7.3.5</span> Level</h4>
<div class="outline-text-4" id="text-7-3-5">




<pre class="src src-scheme">(<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">make-level</span> . problems)
  <span style="color: #4E9A06;">"Level compound data-type creator. </span>
<span style="color: #4E9A06;">Levels are logical groupings of problems for guilecraft. They consist of any number of problems which are combined to set a soft limit to the number of problems that are added to the balancing algorithm at any one time."</span>
  (cons 'level problems))
</pre>

</div>

</div>

<div id="outline-container-7-3-6" class="outline-4">
<h4 id="sec-7-3-6"><span class="section-number-4">7.3.6</span> Module</h4>
<div class="outline-text-4" id="text-7-3-6">




<pre class="src src-scheme">  (<span style="color: #A52A2A; font-weight: bold;">define</span> (<span style="color: #00578E; font-weight: bold;">make-gc-module</span> . levels)
    <span style="color: #4E9A06;">"Module compound data-type creator. </span>
<span style="color: #4E9A06;">  Modules are the primary way by which sets of problems, through the grouping of levels, are linked into a whole in Guilecraft. Modules consist of any number of levels.</span>
<span style="color: #4E9A06;">Modules should be thought of as narrating devices which provide a context through which users can engage with study materials."</span>
    (cons 'module levels))
</pre>

</div>
</div>

</div>
